In [277]:
import pandas as pd 
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

In [278]:
df_train=pd.read_excel("Data_train.xlsx")

In [279]:
df_train.head()

,Airline,Date_of_Journey,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price
0,IndiGo,24/03/2019,Banglore,New Delhi,BLR → DEL,22:20,01:10 22 Mar,2h 50m,non-stop,No info,3897
1,Air India,1/05/2019,Kolkata,Banglore,CCU → IXR → BBI → BLR,05:50,13:15,7h 25m,2 stops,No info,7662
2,Jet Airways,9/06/2019,Delhi,Cochin,DEL → LKO → BOM → COK,09:25,04:25 10 Jun,19h,2 stops,No info,13882
3,IndiGo,12/05/2019,Kolkata,Banglore,CCU → NAG → BLR,18:05,23:30,5h 25m,1 stop,No info,6218
4,IndiGo,01/03/2019,Banglore,New Delhi,BLR → NAG → DEL,16:50,21:35,4h 45m,1 stop,No info,13302

In [280]:
df_test=pd.read_excel("Test_set.xlsx")

In [281]:
df_test.head()

,Airline,Date_of_Journey,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info
0,Jet Airways,6/06/2019,Delhi,Cochin,DEL → BOM → COK,17:30,04:25 07 Jun,10h 55m,1 stop,No info
1,IndiGo,12/05/2019,Kolkata,Banglore,CCU → MAA → BLR,06:20,10:20,4h,1 stop,No info
2,Jet Airways,21/05/2019,Delhi,Cochin,DEL → BOM → COK,19:15,19:00 22 May,23h 45m,1 stop,In-flight meal not included
3,Multiple carriers,21/05/2019,Delhi,Cochin,DEL → BOM → COK,08:00,21:00,13h,1 stop,No info
4,Air Asia,24/06/2019,Banglore,Delhi,BLR → DEL,23:55,02:45 25 Jun,2h 50m,non-stop,No info

In [282]:
df=df_train.append(df_test)
df.head()

C:\Users\DCL\AppData\Local\Temp\ipykernel_8052\2683340988.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df=df_train.append(df_test)

,Airline,Date_of_Journey,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price
0,IndiGo,24/03/2019,Banglore,New Delhi,BLR → DEL,22:20,01:10 22 Mar,2h 50m,non-stop,No info,3897.0
1,Air India,1/05/2019,Kolkata,Banglore,CCU → IXR → BBI → BLR,05:50,13:15,7h 25m,2 stops,No info,7662.0
2,Jet Airways,9/06/2019,Delhi,Cochin,DEL → LKO → BOM → COK,09:25,04:25 10 Jun,19h,2 stops,No info,13882.0
3,IndiGo,12/05/2019,Kolkata,Banglore,CCU → NAG → BLR,18:05,23:30,5h 25m,1 stop,No info,6218.0
4,IndiGo,01/03/2019,Banglore,New Delhi,BLR → NAG → DEL,16:50,21:35,4h 45m,1 stop,No info,13302.0

In [283]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 13354 entries, 0 to 2670
Data columns (total 11 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          13354 non-null  object
 1   Date_of_Journey  13354 non-null  object
 2   Source           13354 non-null  object
 3   Destination      13354 non-null  object
 4   Route            13353 non-null  object
 5   Dep_Time         13354 non-null  object
 6   Arrival_Time     13354 non-null  object
 7   Duration         13354 non-null  object
 8   Total_Stops      13353 non-null  object
 9   Additional_Info  13354 non-null  object
 10  Price            10683 non-null  float64
dtypes: float64(1), object(10)
memory usage: 1.2+ MB

In [284]:
df.isnull().sum()

Airline               0
Date_of_Journey       0
Source                0
Destination           0
Route                 1
Dep_Time              0
Arrival_Time          0
Duration              0
Total_Stops           1
Additional_Info       0
Price              2671
dtype: int64

In [285]:
df.columns

Index(['Airline', 'Date_of_Journey', 'Source', 'Destination', 'Route',
       'Dep_Time', 'Arrival_Time', 'Duration', 'Total_Stops',
       'Additional_Info', 'Price'],
      dtype='object')

In [286]:
df[df['Total_Stops'].isnull()]

,Airline,Date_of_Journey,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price
9039,Air India,6/05/2019,Delhi,Cochin,NaN,09:45,09:25 07 May,23h 40m,NaN,No info,7480.0

In [287]:
df.drop('Route',axis=1,inplace=True)

In [288]:
df.columns

Index(['Airline', 'Date_of_Journey', 'Source', 'Destination', 'Dep_Time',
       'Arrival_Time', 'Duration', 'Total_Stops', 'Additional_Info', 'Price'],
      dtype='object')

In [289]:
df.drop(9039,axis=0,inplace=True)

In [290]:
df.isnull().sum()

Airline               0
Date_of_Journey       0
Source                0
Destination           0
Dep_Time              0
Arrival_Time          0
Duration              0
Total_Stops           0
Additional_Info       0
Price              2671
dtype: int64

In [291]:
df['Date_of_Journey'].value_counts().index

Index(['18/05/2019', '6/06/2019', '9/05/2019', '12/06/2019', '21/05/2019',
       '9/06/2019', '21/03/2019', '15/05/2019', '27/05/2019', '24/06/2019',
       '15/06/2019', '1/06/2019', '27/06/2019', '3/06/2019', '6/03/2019',
       '24/03/2019', '27/03/2019', '24/05/2019', '6/05/2019', '1/05/2019',
       '1/04/2019', '12/05/2019', '3/03/2019', '9/03/2019', '18/03/2019',
       '15/03/2019', '01/03/2019', '12/03/2019', '9/04/2019', '3/04/2019',
       '21/06/2019', '18/06/2019', '03/03/2019', '09/03/2019', '06/03/2019',
       '3/05/2019', '6/04/2019', '24/04/2019', '15/04/2019', '27/04/2019',
       '21/04/2019', '18/04/2019', '12/04/2019', '1/03/2019'],
      dtype='object')

In [292]:
df['Date_of_Journey'].value_counts().index.str.split("/")[0]

['18', '05', '2019']

In [293]:
df['day']=df['Date_of_Journey'].str.split("/").str[0].astype(int)

In [294]:
df['month']=df['Date_of_Journey'].str.split("/").str[1].astype(int)
df['year']=df['Date_of_Journey'].str.split("/").str[2].astype(int)

In [295]:
df.head()

,Airline,Date_of_Journey,Source,Destination,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price,day,month,year
0,IndiGo,24/03/2019,Banglore,New Delhi,22:20,01:10 22 Mar,2h 50m,non-stop,No info,3897.0,24,3,2019
1,Air India,1/05/2019,Kolkata,Banglore,05:50,13:15,7h 25m,2 stops,No info,7662.0,1,5,2019
2,Jet Airways,9/06/2019,Delhi,Cochin,09:25,04:25 10 Jun,19h,2 stops,No info,13882.0,9,6,2019
3,IndiGo,12/05/2019,Kolkata,Banglore,18:05,23:30,5h 25m,1 stop,No info,6218.0,12,5,2019
4,IndiGo,01/03/2019,Banglore,New Delhi,16:50,21:35,4h 45m,1 stop,No info,13302.0,1,3,2019

In [296]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 13353 entries, 0 to 2670
Data columns (total 13 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          13353 non-null  object
 1   Date_of_Journey  13353 non-null  object
 2   Source           13353 non-null  object
 3   Destination      13353 non-null  object
 4   Dep_Time         13353 non-null  object
 5   Arrival_Time     13353 non-null  object
 6   Duration         13353 non-null  object
 7   Total_Stops      13353 non-null  object
 8   Additional_Info  13353 non-null  object
 9   Price            10682 non-null  float64
 10  day              13353 non-null  int32
 11  month            13353 non-null  int32
 12  year             13353 non-null  int32
dtypes: float64(1), int32(3), object(9)
memory usage: 1.3+ MB

In [297]:
df.drop('Date_of_Journey', axis=1,inplace=True)

In [298]:
df.columns

Index(['Airline', 'Source', 'Destination', 'Dep_Time', 'Arrival_Time',
       'Duration', 'Total_Stops', 'Additional_Info', 'Price', 'day', 'month',
       'year'],
      dtype='object')

In [299]:
df['Dep_Time'].str.split(":")

0       [22, 20]
1       [05, 50]
2       [09, 25]
3       [18, 05]
4       [16, 50]
          ...
2666    [20, 30]
2667    [14, 20]
2668    [21, 50]
2669    [04, 00]
2670    [04, 55]
Name: Dep_Time, Length: 13353, dtype: object

In [300]:
df['Dep_hour']=df['Dep_Time'].str.split(":").str[0].astype(int)
df['Dep_min']=df['Dep_Time'].str.split(":").str[1].astype(int)

In [301]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 13353 entries, 0 to 2670
Data columns (total 14 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          13353 non-null  object
 1   Source           13353 non-null  object
 2   Destination      13353 non-null  object
 3   Dep_Time         13353 non-null  object
 4   Arrival_Time     13353 non-null  object
 5   Duration         13353 non-null  object
 6   Total_Stops      13353 non-null  object
 7   Additional_Info  13353 non-null  object
 8   Price            10682 non-null  float64
 9   day              13353 non-null  int32
 10  month            13353 non-null  int32
 11  year             13353 non-null  int32
 12  Dep_hour         13353 non-null  int32
 13  Dep_min          13353 non-null  int32
dtypes: float64(1), int32(5), object(8)
memory usage: 1.3+ MB

In [302]:
df.head(1)

,Airline,Source,Destination,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price,day,month,year,Dep_hour,Dep_min
0,IndiGo,Banglore,New Delhi,22:20,01:10 22 Mar,2h 50m,non-stop,No info,3897.0,24,3,2019,22,20

In [303]:
df.drop('Dep_Time', axis=1,inplace=True)

In [304]:
df.head(1)

,Airline,Source,Destination,Arrival_Time,Duration,Total_Stops,Additional_Info,Price,day,month,year,Dep_hour,Dep_min
0,IndiGo,Banglore,New Delhi,01:10 22 Mar,2h 50m,non-stop,No info,3897.0,24,3,2019,22,20

In [305]:
df['Arrival_Time'].str.split(" ").str[0].str.split(":")

0       [01, 10]
1       [13, 15]
2       [04, 25]
3       [23, 30]
4       [21, 35]
          ...
2666    [20, 25]
2667    [16, 55]
2668    [04, 25]
2669    [19, 15]
2670    [19, 15]
Name: Arrival_Time, Length: 13353, dtype: object

In [306]:
df['Arrival_hour']=df['Arrival_Time'].str.split(" ").str[0].str.split(":").str[0].astype(int)
df['Arrival_min']=df['Arrival_Time'].str.split(" ").str[0].str.split(":").str[1].astype(int)

In [307]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 13353 entries, 0 to 2670
Data columns (total 15 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          13353 non-null  object
 1   Source           13353 non-null  object
 2   Destination      13353 non-null  object
 3   Arrival_Time     13353 non-null  object
 4   Duration         13353 non-null  object
 5   Total_Stops      13353 non-null  object
 6   Additional_Info  13353 non-null  object
 7   Price            10682 non-null  float64
 8   day              13353 non-null  int32
 9   month            13353 non-null  int32
 10  year             13353 non-null  int32
 11  Dep_hour         13353 non-null  int32
 12  Dep_min          13353 non-null  int32
 13  Arrival_hour     13353 non-null  int32
 14  Arrival_min      13353 non-null  int32
dtypes: float64(1), int32(7), object(7)
memory usage: 1.3+ MB

In [308]:
df.drop('Arrival_Time', axis=1,inplace=True)

In [309]:
df.head(1)

,Airline,Source,Destination,Duration,Total_Stops,Additional_Info,Price,day,month,year,Dep_hour,Dep_min,Arrival_hour,Arrival_min
0,IndiGo,Banglore,New Delhi,2h 50m,non-stop,No info,3897.0,24,3,2019,22,20,1,10

In [310]:
df['Additional_Info'].value_counts()

No info                         10492
In-flight meal not included      2426
No check-in baggage included      396
1 Long layover                     20
Change airports                     8
Business class                      5
No Info                             3
1 Short layover                     1
Red-eye flight                      1
2 Long layover                      1
Name: Additional_Info, dtype: int64

In [311]:
df.drop('Additional_Info', axis=1,inplace=True)

In [312]:
df.head(1)

,Airline,Source,Destination,Duration,Total_Stops,Price,day,month,year,Dep_hour,Dep_min,Arrival_hour,Arrival_min
0,IndiGo,Banglore,New Delhi,2h 50m,non-stop,3897.0,24,3,2019,22,20,1,10

In [313]:
df['Total_Stops'].unique()

array(['non-stop', '2 stops', '1 stop', '3 stops', '4 stops'],
      dtype=object)

In [314]:
df['Total_Stops']=df['Total_Stops'].map({'non-stop':0,'1 stop':1,'2 stops':2,'3 stops':3, '4 stops':4})

In [315]:
df['Total_Stops']

0       0
1       2
2       2
3       1
4       1
       ..
2666    1
2667    0
2668    1
2669    1
2670    1
Name: Total_Stops, Length: 13353, dtype: int64

In [316]:
df.head()

,Airline,Source,Destination,Duration,Total_Stops,Price,day,month,year,Dep_hour,Dep_min,Arrival_hour,Arrival_min
0,IndiGo,Banglore,New Delhi,2h 50m,0,3897.0,24,3,2019,22,20,1,10
1,Air India,Kolkata,Banglore,7h 25m,2,7662.0,1,5,2019,5,50,13,15
2,Jet Airways,Delhi,Cochin,19h,2,13882.0,9,6,2019,9,25,4,25
3,IndiGo,Kolkata,Banglore,5h 25m,1,6218.0,12,5,2019,18,5,23,30
4,IndiGo,Banglore,New Delhi,4h 45m,1,13302.0,1,3,2019,16,50,21,35

In [317]:
df[df['Duration']=='5m']

,Airline,Source,Destination,Duration,Total_Stops,Price,day,month,year,Dep_hour,Dep_min,Arrival_hour,Arrival_min
6474,Air India,Mumbai,Hyderabad,5m,2,17327.0,6,3,2019,16,50,16,55
2660,Air India,Mumbai,Hyderabad,5m,2,NaN,12,3,2019,16,50,16,55

In [318]:
df.drop([6474,2660],axis=0,inplace=True)

In [319]:
df['Duration'].head(10)

0     2h 50m
1     7h 25m
2        19h
3     5h 25m
4     4h 45m
5     2h 25m
6    15h 30m
7     21h 5m
8    25h 30m
9     7h 50m
Name: Duration, dtype: object

In [320]:
df[df['Duration']==' 50m']

Empty DataFrame
Columns: [Airline, Source, Destination, Duration, Total_Stops, Price, day, month, year, Dep_hour, Dep_min, Arrival_hour, Arrival_min]
Index: []

In [324]:
df['duration_hour']=df['Duration'].str.split(' ').str[0].str.split('h').str[0].astype(int)

In [325]:
df.drop('Duration',axis=1,inplace=True)

In [327]:
df.head(1)

,Airline,Source,Destination,Total_Stops,Price,day,month,year,Dep_hour,Dep_min,Arrival_hour,Arrival_min,duration_hour
0,IndiGo,Banglore,New Delhi,0,3897.0,24,3,2019,22,20,1,10,2

In [328]:
from sklearn.preprocessing import LabelEncoder
labelencoder=LabelEncoder()

In [330]:
df['Airline']=labelencoder.fit_transform(df['Airline'])
df['Source']=labelencoder.fit_transform(df['Source'])
df['Destination']=labelencoder.fit_transform(df['Destination'])

In [331]:
df.head()

,Airline,Source,Destination,Total_Stops,Price,day,month,year,Dep_hour,Dep_min,Arrival_hour,Arrival_min,duration_hour
0,3,0,5,0,3897.0,24,3,2019,22,20,1,10,2
1,1,3,0,2,7662.0,1,5,2019,5,50,13,15,7
2,4,2,1,2,13882.0,9,6,2019,9,25,4,25,19
3,3,3,0,1,6218.0,12,5,2019,18,5,23,30,5
4,3,0,5,1,13302.0,1,3,2019,16,50,21,35,4